
## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/10052)


<pre><code>Plan: 39 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA
  * aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637
  * aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512
  * aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4
  * aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884
  * aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7
  * aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204
  * aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
  * aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26
  * aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B
  * aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54
  * aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA
  * aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633
  * aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B
  * aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2
  * aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87
  * aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F
  * aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476
  * aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309
  * aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571
  * aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4
  * aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C
  * aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733
  * aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683
  * aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214
  * aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1
  * aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA will be created
  + resource "aws_acm_certificate" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA" {
      + arn                       = (known after apply)
      + domain_name               = "sendgrid-data.getpocket.com"
      + domain_validation_options = [
          + {
              + domain_name           = "sendgrid-data.getpocket.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "sendgrid-data.getpocket.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637 will be created
  + resource "aws_acm_certificate_validation" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422 will be created
  + resource "aws_api_gateway_base_path_mapping" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422" {
      + api_id      = (known after apply)
      + domain_name = "sendgrid-data.getpocket.com"
      + id          = (known after apply)
      + stage_name  = "prod"
    }

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 will be created
  + resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4 will be created
  + resource "aws_api_gateway_domain_name" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4" {
      + arn                                    = (known after apply)
      + certificate_arn                        = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "sendgrid-data.getpocket.com"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)
    }

  # aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884 will be created
  + resource "aws_api_gateway_integration" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7 will be created
  + resource "aws_api_gateway_method" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204 will be created
  + resource "aws_api_gateway_resource" "apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "events"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018 will be created
  + resource "aws_api_gateway_rest_api" "apigateway-lambda_api-gateway-rest_FD4A1018" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "SendGridData-Prod-API-Gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be created
  + resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26 will be created
  + resource "aws_cloudwatch_log_group" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/SendGridData-Prod-ApiGateway-Function"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B will be created
  + resource "aws_codedeploy_app" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Lambda"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "SendGridData-Prod-ApiGateway-Lambda"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54 will be created
  + resource "aws_codedeploy_deployment_group" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54" {
      + app_name                    = "SendGridData-Prod-ApiGateway-Lambda"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.LambdaAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "SendGridData-Prod-ApiGateway-Lambda"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags_all                    = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }
    }

  # aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA will be created
  + resource "aws_iam_policy" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SendGridData-Prod-ApiGateway-ExecutionRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "firehose:PutRecordBatch",
                          + "firehose:PutRecord",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:firehose:*:*:deliverystream/prod-sendgrid-events-to-braveheart"
                    },
                  + {
                      + Action   = "cloudwatch:PutMetricData"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:AttachNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633 will be created
  + resource "aws_iam_role" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SendGridData-Prod-ApiGateway-ExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B will be created
  + resource "aws_iam_role" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SendGridData-Prod-ApiGateway-CodeDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2 will be created
  + resource "aws_iam_role_policy_attachment" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SendGridData-Prod-ApiGateway-ExecutionRole"
    }

  # aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87 will be created
  + resource "aws_iam_role_policy_attachment" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRoleForLambda"
      + role       = "SendGridData-Prod-ApiGateway-CodeDeployRole"
    }

  # aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F will be created
  + resource "aws_lambda_alias" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F" {
      + arn              = (known after apply)
      + function_name    = "SendGridData-Prod-ApiGateway-Function"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "DEPLOYED"
    }

  # aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476 will be created
  + resource "aws_lambda_function" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "index.js.zip"
      + function_name                  = "SendGridData-Prod-ApiGateway-Function"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "W3H4FeYY1XpXur5FoFbOhDmOD96dMyqqzRIkSf0dED4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_CLOUDWATCH_METRIC_NAMESPACE"   = "SendGridData-Prod"
              + "AWS_FIREHOSE_DELIVERY_STREAM_NAME" = "prod-sendgrid-events-to-braveheart"
              + "ENVIRONMENT"                       = "production"
              + "GIT_SHA"                           = (sensitive value)
              + "SENTRY_DSN"                        = (sensitive value)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-02a2fb18ab721ff77",
            ]
          + subnet_ids                  = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309 will be created
  + resource "aws_lambda_permission" "apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "SendGridData-Prod-ApiGateway-Function"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "DEPLOYED"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571 will be created
  + resource "aws_route53_record" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4 will be created
  + resource "aws_route53_record" "apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sendgrid-data.getpocket.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C will be created
  + resource "aws_route53_record" "apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sendgrid-data.getpocket.com"
      + records         = (known after apply)
      + ttl             = 86400
      + type            = "NS"
      + zone_id         = "Z21HMDYFB951W4"
    }

  # aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733 will be created
  + resource "aws_route53_zone" "apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "sendgrid-data.getpocket.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683 will be created
  + resource "aws_s3_bucket" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "pocket-sendgriddata-prod-apigateway"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214 will be created
  + resource "aws_s3_bucket_acl" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1 will be created
  + resource "aws_s3_bucket_ownership_controls" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A will be created
  + resource "aws_s3_bucket_public_access_block" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "SendGridData-Prod-Infrastructure-Alarm-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "SendGridData-Prod-Infrastructure-Alarm-Non-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "SendGridData-Prod-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "SendGridData-Prod-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 39 to add, 0 to change, 0 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 900, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│  900:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 900, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
  900:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"e178dc2d-9267-43e6-b152-24fd233f704f","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":56,"Program":"tfcmt","SHA1":"a57bd820cd688826c2b686f18cf5b94a5816cd26","Target":"sendgrid-data-cdk","Vars":{}} -->